OpenQBMM-OpenFOAM-v2306/validation/polydisperseBubbleFoam/Pfleger/PflegerPolydisperse3D/constant/quadratureProperties.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      quadratureProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fieldMomentInversion    basicFieldMomentInversion;

basicMomentInversion
{
    univariateMomentInversion   Gauss;
}

moments
(
    (0)
    (1)
    (2)
    (3)
    (4)
    (5)
);

nodes
(
    (0)
    (1)
    (2)
);

residuals
{
    minM0   1;
    minM1   1e-6;
}

// ************************************************************************* //
